---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.Dispose
source: html/ffb5fa8d-1001-de54-358b-08b24422698e.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.Dispose Method

Releases all resources used by the RebarHandlesData

## Syntax (C#)
```csharp
public void Dispose()
```